def make_help_message():
    resulting_message = "*/start* - для добавления текущего для рассылки изменений\n" \
                        "*/show_next_game* - показать следующую игру по расписанию\n" \
                        "*/show_league_tt* - показать текущее расписание лиги\n" \
                        "*/show_cup_tt* - показать текущее расписание кубка\n" \
                        "*/see_cur_pos* - показать текущее место команды\n\n" \
                        "Помимо выше перечисленных функций, бот сам следит за изменениями в текущем расписании и в " \
                        "случае переноса оповещает об этом"
    return resulting_message
