import unittest

from database import cache, database
from mainTelegram import bot

'''lg_test = [['SkyStepS', 'ВК_БЮРО', 'перенесена_на_неопределенную_дату'],
           ['SkyStepS', 'ANTIFIRE', '15.10.2022_18:20_(Сб)', 'улица_Маршала_Новикова,_1к3', '3:0'],
           ['SkyStepS', 'Юниоры Приморы', '20.10.2022 18:45 (Чт)', 'Королева 23', '3:0'],
           ['Баррель', 'SkyStepS', '24.10.2022 20:45 (Пн)', 'ул. Вязовая, д. 10 (Академия Платонова)', '1:3'],
           ['SkyStepS', 'RED BARONS', '19.11.2022 18:20 (Сб)', 'улица Маршала Новикова, 1к3', '3:2'],
           ['THWW', 'SkyStepS', '27.11.2022 11:50 (Вс)', 'Ул. Шевченко, д.3, школа#6', '0:3'],
           ['Маяк', 'SkyStepS', '04.12.2022 18:45 (Вс)', 'Пр. Динамо,44Б', '0:3'],
           ['Фаер', 'SkyStepS', '07.12.2022 20:45 (Ср)', 'проспект Сизова, 17', '0:3'],
           ['SkyStepS', 'ВК Остров', 'перенесена на неопределенную дату'],
           ['SkyStepS', 'Prima', 'перенесена на неопределенную дату'],
           ['АБСОЛЮТ-1', 'SkyStepS', 'перенесена на неопределенную дату']]
cg_test = [['3 (до 29.01.2023)', 'SkyStepS'], ['1 (до 20.11.2022)', 'SkyStepS', 'Нет Идей', '22.10.2022 11:30 (Сб)', 
           'Комендантский 29/2', '3:0'],
           ['2 (до 31.12.2022)', 'SkyStepS', 'Океанприбор', '27.12.2022 18:35 (Вт)', 'Комендантский просп., 29, корп. 2'
           , '3:2']'''

lg_test = [['9 легион', 'SkyStepS', '11.02.2023 21:00 (Сб)', 'Гражданский проспект 7'],
           ['SkyStepS', 'ПРОСВЕТ', '18.02.2023 11:30 (Сб)', 'Комендантский просп. 29к2'],
           ['SkyStepS', 'VOLBOL - M', '25.02.2023 11:30 (Сб)', 'Комендантский просп. 29к2'],
           ['Вертикаль', 'SkyStepS', '04.03.2023 16:00 (Сб)', 'пос. Металлострой, ул. Полевая, д. 10 лит. А, с/з №2'],
           ['Оккервиль', 'SkyStepS', '10.03.2023 19:00 (Пт)', 'Санкт-Петербург проспект Солидарности д.11 корп.2'],
           ['Морские волки', 'SkyStepS', '15.03.2023 19:40 (Ср)', 'Двинская ул., 5/7'],
           ['SkyStepS', 'Oris (Uglovo Team)', '25.03.2023 11:30 (Сб)', 'Комендантский просп. 29к2'],
           ['SkyStepS', 'LEGENDA', '01.04.2023 11:30 (Сб)', 'Комендантский просп. 29к2'],
           ['Охта', 'SkyStepS', '08.04.2023 18:50 (Сб)', 'пр. Энергетиков 50']]
cg_test = [['1 (до 20.11.2022)', 'SkyStepS', 'Нет Идей', '22.10.2022 11:30 (Сб)', 'Комендантский 29/2', '3:0'],
           ['2 (до 31.12.2022)', 'SkyStepS', 'Океанприбор', '27.12.2022 18:35 (Вт)',
            'Комендантский просп., 29, корп. 2', '3:2'],
           ['3 (до 29.01.2023)', 'ПМЦ Калининский', 'SkyStepS', '20.01.2023 19:50 (Пт)', 'Демьяна Бедного 9', '3:2']]


class TestDB(unittest.TestCase):
    def test_league_games(self):
        database.insert_lg(lg_test)
        self.assertEqual(database.select_lg(0),
                         (0, '9 легион', 'SkyStepS', '11.02.2023 21:00 (Сб)', 'Гражданский проспект 7', ''))
        self.assertEqual(database.select_lg(1),
                         (1, 'SkyStepS', 'ПРОСВЕТ', '18.02.2023 11:30 (Сб)', 'Комендантский просп. 29к2', ''))
        self.assertEqual(database.select_lg(2),
                         (2, 'SkyStepS', 'VOLBOL - M', '25.02.2023 11:30 (Сб)', 'Комендантский просп. 29к2', ''))
        self.assertEqual(database.select_lg(3),
                         (3, 'Вертикаль', 'SkyStepS', '04.03.2023 16:00 (Сб)',
                          'пос. Металлострой, ул. Полевая, д. 10 лит. А, с/з №2', ''))
        self.assertEqual(database.select_lg(4),
                         (4, 'Оккервиль', 'SkyStepS', '10.03.2023 19:00 (Пт)',
                          'Санкт-Петербург проспект Солидарности д.11 корп.2', ''))
        self.assertEqual(database.select_lg(5),
                         (5, 'Морские волки', 'SkyStepS', '15.03.2023 19:40 (Ср)', 'Двинская ул., 5/7', ''))
        self.assertEqual(database.select_lg(6),
                         (6, 'SkyStepS', 'Oris (Uglovo Team)', '25.03.2023 11:30 (Сб)', 'Комендантский просп. 29к2',''))
        self.assertEqual(database.select_lg(7),
                         (7, 'SkyStepS', 'LEGENDA', '01.04.2023 11:30 (Сб)', 'Комендантский просп. 29к2', ''))
        self.assertEqual(database.select_lg(8),
                         (8, 'Охта', 'SkyStepS', '08.04.2023 18:50 (Сб)', 'пр. Энергетиков 50', ''))
        database.clear_lg()

    def test_cup_games(self):
        database.insert_cg(cg_test)
        self.assertEqual(database.select_cg(0),
                         (0, '1 (до 20.11.2022)', 'SkyStepS', 'Нет Идей', '22.10.2022 11:30 (Сб)', 'Комендантский 29/2',
                          '3:0'))
        self.assertEqual(database.select_cg(1),
                         (1, '2 (до 31.12.2022)', 'SkyStepS', 'Океанприбор', '27.12.2022 18:35 (Вт)',
                          'Комендантский просп., 29, корп. 2', '3:2'))
        self.assertEqual(database.select_cg(2),
                         (2, '3 (до 29.01.2023)', 'ПМЦ Калининский', 'SkyStepS', '20.01.2023 19:50 (Пт)',
                          'Демьяна Бедного 9', '3:2'))
        database.clear_cg()


if __name__ == '__main__':
    unittest.main()
